Reports/бит_КарточкаРасчетовПоЛицевомуСчетуНовый2020.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_КарточкаРасчетовПоЛицевомуСчетуНовый2020</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМакет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/бит_КарточкаРасчетовПоЛицевомуСчетуНовый2020/Ext/ObjectModule.bsl
#Область ПроцедурыОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("НачалоПериода");
	СписокПараметровНаФорме.Добавить("КонецПериода");
	СписокПараметровНаФорме.Добавить("ЛицевойСчет");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		
		НовыйПараметрКД =  Новый ПараметрКомпоновкиДанных(ИмяПараметра);
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(НовыйПараметрКД);
		
		Если ЗначениеПараметра = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = ЭтотОбъект[ИмяПараметра];
		
	КонецЦикла;
	 
	// Установим заголовок.
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыВывода.
	НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	
	Ответсвенный = ОтветсвенныйПоЛС();
	
	ЗначениеПараметра.Значение = " Карточка расчетов
	| за период с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy") +"
	| " + ЛицевойСчет.Организация + "
	| по лицевому счету " + ЛицевойСчет + " " + Ответсвенный;
	ЗначениеПараметра.Использование = Истина;
	
	ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.НачалоПериода.Значение = ЭтотОбъект.НачалоПериода;
	ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.КонецПериода.Значение = ЭтотОбъект.КонецПериода;
	ЭтотОбъект.СхемаКомпоновкиДанных.Параметры.ЛицевойСчет.Значение = ЭтотОбъект.ЛицевойСчет;
	
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ОтветсвенныйПоЛС()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)";
	
	Ответсвенный = "";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Ответсвенный = Выборка.ФизЛицо;
		
	КонецЕсли;
	
	Возврат Ответсвенный;
	
КонецФункции // ()

Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент.Очистить();
	
	Макет = ПолучитьМакет("КарточкаРасчетов");
	
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаСальдо = Макет.ПолучитьОбласть("СтрокаСальдо");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого        = Макет.ПолучитьОбласть("Итого");
	
	Ответсвенный = ОтветсвенныйПоЛС();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК Задолженность,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор КАК Документ,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период КАК Дата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начислено,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ТОГДА ""Оплата""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА ""Скидка по начислению""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|									ТОГДА ""Перерасчет начисления""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|											ТОГДА ""Ввод начальных остатков""
	|										ИНАЧЕ """"
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Период,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начсиления""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ТОГДА ""Оплата""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА ""Скидка по начислению""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|									ТОГДА ""Перерасчет начисления""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|											ТОГДА ""Ввод начальных остатков""
	|										ИНАЧЕ """"
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				ИЛИ бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|			ТОГДА ""Начисления""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					ТОГДА ""Оплата""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|							ТОГДА ""Скидка по начислению""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|									ТОГДА ""Перерасчет начисления""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА бит_НачисленияПоУслугамЖКХОстаткиИОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|											ТОГДА ""Ввод начальных остатков""
	|										ИНАЧЕ """"
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Оплата),
	|	СУММА(Начислено)
	|ПО
	|	ЛицевойСчет";
	
	ОбластьШапка.Параметры.НачалоПериода = Формат(НачалоПериода, "ДФ=dd.MM.yyyy") ;
	ОбластьШапка.Параметры.КонецПериода  = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Организация   = ЛицевойСчет.Организация;
	ОбластьШапка.Параметры.ЛицевойСчет   = ЛицевойСчет;
	ОбластьШапка.Параметры.Ответсвенный  = Ответсвенный;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ОБластьИтого.Параметры.Заполнить(ВыборкаЛС);
		
		Выборка = ВыборкаЛС.Выбрать();
		КоличествоЭлементов = Выборка.Количество();
		
		ТекСтрока = 0;
		Пока Выборка.Следующий() Цикл
			
			Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
			
			ТекСтрока = ТекСтрока + 1;
			
			Если ТекСтрока = 1 Тогда
			
				ОбластьСтрокаСальдо.Параметры.Дата        = Дата;
				ОбластьСтрокаСальдо.Параметры.Задолженность = ?(ЗначениеЗаполнено(Выборка.Документ), 0, Выборка.Задолженность);
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаСальдо);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Документ) Тогда
				
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ОбластьСтрока.Параметры.Дата = Дата;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
			КонецЕсли;
			
			Если ТекСтрока = КоличествоЭлементов Тогда
				
				ТабличныйДокумент.Вывести(ОБластьИтого);
				
				ОбластьСтрокаСальдо.Параметры.Дата        = Дата;
				ОбластьСтрокаСальдо.Параметры.Задолженность = Выборка.Задолженность;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаСальдо);
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры


// БИТ ЖКХ 04.03.2020
Функция ПолучитьДанныеПениДокумента(Док) Экспорт	
   запрос = новый Запрос;
   запрос.Текст = "ВЫБРАТЬ
	| бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	| бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|СУММА(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток) КАК СальдоПени
    |ИЗ
	|РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(КОНЕЦПЕРИОДА(&Момент, ДЕНЬ), ) КАК бит_НачислениеПениПоУслугамЖКХОстатки
    | СГРУППИРОВАТЬ ПО
	|бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
	|бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
    |УПОРЯДОЧИТЬ ПО
	|ЛицевойСчет";
	
   запрос.УстановитьПараметр("Момент", Док.Дата);	
   таблицаДока = запрос.Выполнить().Выгрузить();
//	бит_ОтчетыВызовСервера.ПолучитьДанныеПениДокумента();
   возврат 777;
     	
КонецФункции

#КонецОбласти
